

const Skills = [
            { 
                title : "그린컴퓨터아트학원 - 웹퍼블리셔 프론트엔드 개발 실무 양성과정",
                date : "2021년 9월1일 ~ 2022년 3월2일",
                info : [
                    "HTML, CSS, Javascript, Jquery, Scss, Vue를 배웠으며 이를 통해 원하는 것들을 구현할 수 있습니다.",
                    "Ajax를 통한 비동기통신을 배웠으며 XMLHttpRequest, Jqeury, fetch를 이용한 통신방법들을 경험했습니다.",
                    "Ajax 요청을 통해 json형태의 API를 받아 해당 데이터를 활용한 화면구현 및 응용을 할 수 있습니다."
                ]
            },
            { 
                title : "수료 이후의 독학과정 - React",
                date : "2022년 3월2일 ~ 진행중",
                info : [
                    "React에 대한 관심으로 React를 독학으로 공부했습니다.",
                    "Class방식과 Hooks방식 두 가지 모두 경험했으나 주로 Hooks 방식으로 공부했습니다.",
                    "state관리와 핸들링, Props전달, Router사용, styled-components, Context API 등을 학습했으며 활용이 가능합니다."
                ]
            },
            { 
                title : "수료 이후의 독학과정 - Redux",
                date : "2022년 3월2일 ~ 진행중",
                info : [
                    "Redux의 원리와 사용방법에 대해 학습했습니다.",
                    "React에서의 Redux 사용에 대해서도 학습했습니다.",
                    "인터넷 강의를 통한 학습을 진행하며 경험해볼 수 있었으나 그 외적으로 직접 제작한 페이지에서는 사용해볼 일은 없었습니다.",
                    "원리와 사용방법에 대해선 충분히 이해하고있습니다."
                ]
            },
            { 
                title : "수료 이후의 독학과정 - TypeScript",
                date : "2022년 3월2일 ~ 진행중",
                info : [
                    "TypeScript의 필요성을 이해하고 사용방법을 학습했습니다.",
                    "인터넷 강의를 통해 전반적인 이해는 했으나 직접 포트폴리오제작에는 아직 사용해보지못하여 타입스크립트를 동반한 리액트 프로젝트를 계획중입니다.",
                ]
            },
            { 
                title : "수료 이후의 독학과정 - NodeJs",
                date : "2022년 3월2일 ~ 진행중",
                info : [
                    "서버요청, DB에 대한 이해가 조금 더 있으면 기존 공부들에 도움이 될 것 같다는 생각으로 기초적인 학습만 진행했습니다.",
                    "express와 MongoDB를 이용했으며 로컬서버를 통해 간단한 페이지를 구현, 읽기, 쓰기, 수정, 삭제 등의 요청 등을 처리하는 페이지를 인터넷 강좌를 진행하며 경험했고 이해했습니다.",
                ]
            },
            { 
                title : "수료 이후의 독학과정 - 기타",
                date : "2022년 3월2일 ~ 진행중",
                info : [
                    "배우고싶은 것들이 많아 여러가지 공부를 진행했으나 가장 중요하게 생각하는 부분은 JS입니다.",
                    "React, TS 공부를 하면서 JS 자체도 조금 더 깊이 들여다볼 수 있었고, 문제풀이나 책, 유튜브 영상들을 통해 JS를 조금 더 알아가고 있습니다.",
                    "특히 국비과정중에는 ES6 문법이나 모듈화 등에 대한 경험이 매우 부족했기에 이런 부분이 독학과정중에 많이 충족이 됐습니다.",
                    "독학 기간은 짧았으나 하루 최소 10시간이상은 공부에 투자하고있으며 발전을 느끼는 이 시간을 즐기고있습니다.",
                    "개인적인 시간투자와 노력, 실무를 통해 꾸준히 성장하고싶습니다."
                ]
            },
]

export default Skills;